-- 选择 OptimalControl 数据库
Use [OptimalControl]
Go

INSERT INTO [Rules]([Name],[Expression],[Operation],[Period],[State],[Priority],[Type],[IsLogged])
     VALUES
			('半自磨功率保护','([@半自磨功率(左)]+[@半自磨功率(右)])>11000','[@半自磨给矿量优化设定值]=[@半自磨给矿量优化设定值]-300','90','true','1','true','true'),
			('半自磨轴压保护','([@半自磨进料端压力]>6)|([@半自磨出料端压力]>6)','[@半自磨给矿量优化设定值]=[@半自磨给矿量优化设定值]-300','90','true','1','true','true'),
			('半自磨循环负荷保护','[@半自磨顽石产生量]>300','[@半自磨给矿量优化设定值]=[@半自磨给矿量优化设定值]-200','90','true','1','true','true'),
			('顽石破碎机启动','([@7A#皮带电流]-[@7A#皮带电流.history])>3','[@半自磨给矿量优化设定值]=[@半自磨给矿量设定值]-450','60','true','2','false','true'),
			('顽石破碎机停止','([@7A#皮带电流.history]-[@7A#皮带电流])>3','[@半自磨给矿量优化设定值]=[@半自磨给矿量设定值]+450','60','true','2','false','true')
GO
